Core/src/src/InformationRegisters/УчетнаяПолитикаРегл/УчетнаяПолитикаРегл.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаРегл</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>СчетНезавершенноеПроизводство</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаДеньги</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаДеньги</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаЗадолженность</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаЗадолженность</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>РозничныйКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорРозничногоКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДДСРозничныхПродаж</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрочихДоходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрочихРасходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрибыльУбытки</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетДеньгиВПути</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаКонвертация</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаКонвертация</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратБезвозмезднойПродажи</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДСБезвозмезднойПродажи</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаНалогаНаПрибыль</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаНалогаНаПрибыльПодлежащийОплате</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаИмпортРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаИмпортВозвратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетТранзитногоСклада</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ВидНадогаДляСчетовНДС</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратБезвозмезднойПродажиСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДСБезвозмезднойПродажиСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДФЛСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратПФСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратВозврат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаСвободнаяпродажа</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаСвободнаяпродажаСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаСебестоимостиВозврат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>НаправлениеДеятелности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизациюОтНачальнойСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьНовуюФормуОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЧекККМВозвратПроверкаЗаполненияПоляКомментарий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВозвратЗапасовПоСебестоимостиПродаж</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>AzRyРозничныйКонтрагентАналитика</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>УчетСебестоимостиВРазрезеОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетСписанияЗапасовРасширение</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьПодарокВТабличнойЧасти</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтрольКоличестваПриВозврате</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СрокКонтроляКоличестваПриВозврате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>РедактированиеСуммыНачисленияВЗаказНарядах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаУправленческая</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ВестиУчетВУпрВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаУчетаПоУпрВалюте</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗапретАктивированияНепроведенных</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВариантЗаполненияРасшифровки</name>
    <type>
      <types>EnumRef.ВариантыЗаполненияРасшифровкиПлатежа</types>
    </type>
  </resources>
  <resources>
    <name>КорректировкаНалоговойДекларацииВоВремяВозвратаАванса</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетФактураПолученныйВидНалогаПриСинхронизации</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </resources>
  <resources>
    <name>СчетФактураПолученныйСчетУчетаПриСинхронизации</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетФактураВыданныйВидНалогаПриСинхронизации</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </resources>
  <resources>
    <name>СчетФактураВыданныйСчетУчетаПриСинхронизации</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьНовыйАлгоритмАмортизацииЛинейнымСпособом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаРеглДоговорЗаймаСотруднику</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаПроцентовРеглДоговорЗаймаСотруднику</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратРеглДоговорЗаймаСотруднику</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаКомиссииРеглДоговорЗаймаСотруднику</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаРеглКредитПолученный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаПроцентовРеглКредитПолученный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратРеглКредитПолученный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаКомиссииРеглКредитПолученный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаРеглКредитВыданный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаПроцентовРеглКредитВыданный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратРеглКредитВыданный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаКомиссииРеглКредитВыданный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретРедактированияЗаписанныхДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаполнениеРеквизитовСинхронизацияЭлектронныхТТН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗаполнятьСчетаВСчетахФактуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>PowerBIСтрокаПодключения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>PowerBIИмяПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>PowerBIПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПереноситьКомментарииВСФОтправленные</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПоступлениеНаСчетСуммаКомиссияИзШапки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НачисленныйНДСНаПолученныйАванс</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ОплаченныеКОплатеНДСНаАванс</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ПредворительныйЗачетПолученныйНаВыдааныАванс</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ЗачетПолученногоНДСНаВыданныАванс</name>
    <comment>ONESOFT-2337</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ПроверкаКоличестваПриВозвратеОтПокупателя</name>
    <comment>Paganini ONESOFT-2685</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВозможностьДобавлятьНовыеВидыОтпусков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СобраниеЗапасовВДокументеСборкаЗапасов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РозничныеПродажиАвтоматическиеСкидкиСразу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИзменитьЛогикуСобранияЗапасов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗагрузкаВыписок_ОтчетЭквайера_АвтозаполнениеДокументов</name>
    <comment>ONESOFT-3473</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КартыЛояльности_СчетЗатратДляБалловРегл</name>
    <comment>ONESOFT-3507</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетДляПредоплаченныхРасходовРегл</name>
    <comment>ONESOFT-3553</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетДляНДСнакопленныхБалловРегл</name>
    <comment>ONESOFT-3553</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетДляНеоперационныхДоходовОтБалловРегл</name>
    <comment>ONESOFT-3566</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>РозничныйПроект</name>
    <comment>ONESOFT-3670</comment>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>ПромежуточныйСчетЗатратДоходовПриВозвратеПоставщику</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <attributes>
    <name>СоответствиеПриПоискеНоменклатурВбазе</name>
    <type>
      <types>EnumRef.ПриоритетСоответствияДляПоискаНоменклатурВБазе</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/CommonModules/ВалютныйУчетПродаж/Module.bsl
Процедура ДвиженияПродажиВВалютеПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	СсылкаНаДокумент = Источник.Отбор.Регистратор.Значение;
	ТаблицаПродажи = Источник.Выгрузить();
	
	Если Не Отказ И Замещение 
			И (ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗаказПокупателя") 
			//ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗакрытиеМесяца") 
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.КорректировкаРеализации") 
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.КорректировкаРегистров")    
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ОтчетОРозничныхПродажах")
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПриходнаяНакладная")
			//ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.РасходнаяНакладная")
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЧекККМ")
			ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЧекККМВозврат")) Тогда
			
		ПараметрыПроцедуры = Новый Структура("СсылкаНаДокумент,ТаблицаПродажи", СсылкаНаДокумент, ТаблицаПродажи);
		
		Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Или Истина Тогда // Отключено фоновое выполнение, чтобы не было блокировок
			
			СформироватьДвиженияПродажиВВалюте(СсылкаНаДокумент, ТаблицаПродажи, Ложь);
			
		Иначе
			
			ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
			ПараметрыВыполнения.КлючФоновогоЗадания = "ФормированиеДвиженийПродажиВВалюте";
			ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ka='მოძრაობის ფორმირება რეზერვები ვალუტაში';ru='Формирование движений Продажи в валюте';en='Formation of movements Sales in currency'");
			
			ДлительныеОперации.ВыполнитьВФоне(
				"ВалютныйУчетПродаж.СформироватьДвиженияПродажиВВалютеВФоне",
				ПараметрыПроцедуры,                                                                                                             
				ПараметрыВыполнения);
		
		КонецЕсли;
		 
	КонецЕсли;
	
КонецПроцедуры

Процедура СформироватьДвиженияПродажиВВалютеВФоне(ПараметрыПроцедуры, АдресХранилища) Экспорт
	
	СформироватьДвиженияПродажиВВалюте(ПараметрыПроцедуры.СсылкаНаДокумент, ПараметрыПроцедуры.ТаблицаПродажи);
	
КонецПроцедуры

Процедура СформироватьДвиженияПродажиВВалюте(СсылкаНаДокумент, ТаблицаПродажи, ЗаписыватьВЖурнал = Истина) Экспорт
	
	ИмяСобытия = "Формирование движений по регистру ПродажиВВалюте";
		
	НаборЗаписей = СсылкаНаДокумент.ПолучитьОбъект().Движения.ПродажиВВалюте;
	
	Если ТаблицаПродажи.Количество()>0 Тогда
	
		РезультатМассив = ПолучитьМассивРезультатов(ТаблицаПродажи);
		
		ОстановитьФормирование = Ложь;                 
		
		ВыборкаУпрВалюта = РезультатМассив[1].Выбрать();
		Если ВыборкаУпрВалюта.Следующий() Тогда       
			Если Не ЗначениеЗаполнено(ВыборкаУпрВалюта.ВалютаУправленческая) Тогда      
				ОстановитьФормирование = Истина;
				ТекстОшибки = "Не задана ""Валюта управленческая"" в регистре сведений ""Учетная политика (бух. учет)""";
				Если ЗаписыватьВЖурнал Тогда
					ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, СсылкаНаДокумент.Метаданные(), СсылкаНаДокумент, ТекстОшибки);
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;	
			КонецЕсли;
			Если Не ЗначениеЗаполнено(ВыборкаУпрВалюта.ДатаНачалаУчетаПоУпрВалюте) Тогда  
				ОстановитьФормирование = Истина;
				ТекстОшибки = "Не задана ""Дата начала учета по управленческой валюте"" в регистре сведений ""Учетная политика (бух. учет)""";				
				Если ЗаписыватьВЖурнал Тогда
					ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, СсылкаНаДокумент.Метаданные(), СсылкаНаДокумент, ТекстОшибки);
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
				КонецЕсли;	
			КонецЕсли;
		Иначе
			Возврат;
		КонецЕсли;    
		
		ВыборкаКурс = РезультатМассив[2].Выбрать();
		Если Не ВыборкаКурс.Следующий() Тогда
			ОстановитьФормирование = Истина;
			ТекстОшибки = СтрШаблон("Не задан курс валюты %1", ВыборкаУпрВалюта.ВалютаУправленческая);
			Если ЗаписыватьВЖурнал Тогда
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, СсылкаНаДокумент.Метаданные(), СсылкаНаДокумент, ТекстОшибки);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
		
		Если ОстановитьФормирование Тогда
			Возврат;
		КонецЕсли;
		
		Для Каждого ТекСтр Из ТаблицаПродажи Цикл
			НовСтр = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр);
			НовСтр.СуммаВал = ТекСтр.Сумма * ВыборкаКурс.Кратность / ВыборкаКурс.Курс;
			НовСтр.СуммаНДСВал = ТекСтр.СуммаНДС * ВыборкаКурс.Кратность / ВыборкаКурс.Курс;
			НовСтр.СебестоимостьВал = ТекСтр.Себестоимость * ВыборкаКурс.Кратность / ВыборкаКурс.Курс;
		КонецЦикла;		
		
		НаборЗаписей.ДополнительныеСвойства.Вставить("ФормироватьПроводки", Истина);
		НаборЗаписей.Записывать = Истина;
		
		Попытка
			НаборЗаписей.Записать(Истина);
		Исключение
			ТекстОшибки = ОписаниеОшибки();
			Если ЗаписыватьВЖурнал Тогда
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, СсылкаНаДокумент.Метаданные(), СсылкаНаДокумент, ТекстОшибки);
			Иначе
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
		КонецПопытки;
		
	Иначе
		
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();   
		
	КонецЕсли; 
		
КонецПроцедуры

Функция ПолучитьМассивРезультатов(ТаблицаПродажи)
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	УчетнаяПолитикаРеглСрезПоследних.ВалютаУправленческая КАК ВалютаУправленческая,
	               |	УчетнаяПолитикаРеглСрезПоследних.ДатаНачалаУчетаПоУпрВалюте КАК ДатаНачалаУчетаПоУпрВалюте
	               |ПОМЕСТИТЬ втУчетнаяПолитика
	               |ИЗ
	               |	РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&НаДату, ) КАК УчетнаяПолитикаРеглСрезПоследних
	               |ГДЕ
	               |	УчетнаяПолитикаРеглСрезПоследних.ВестиУчетВУпрВалюте
	               |	И УчетнаяПолитикаРеглСрезПоследних.ДатаНачалаУчетаПоУпрВалюте <= &НаДату
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	втУчетнаяПолитика.ВалютаУправленческая КАК ВалютаУправленческая,
	               |	втУчетнаяПолитика.ДатаНачалаУчетаПоУпрВалюте КАК ДатаНачалаУчетаПоУпрВалюте
	               |ИЗ
	               |	втУчетнаяПолитика КАК втУчетнаяПолитика
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КурсыВалютСрезПоследних.Курс КАК Курс,
	               |	КурсыВалютСрезПоследних.Кратность КАК Кратность
	               |ИЗ
	               |	втУчетнаяПолитика КАК втУчетнаяПолитика
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&НаДату, ) КАК КурсыВалютСрезПоследних
	               |		ПО втУчетнаяПолитика.ВалютаУправленческая = КурсыВалютСрезПоследних.Валюта
	               |ГДЕ
	               |	НЕ КурсыВалютСрезПоследних.Курс = 0
	               |	И НЕ КурсыВалютСрезПоследних.Кратность = 0";    
	Запрос.УстановитьПараметр("НаДату", ТаблицаПродажи[0].Период);    
	Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1));
	Запрос.УстановитьПараметр("ПустаяВалюта", Справочники.Валюты.ПустаяСсылка());    
	Возврат Запрос.ВыполнитьПакет();
			
КонецФункции
